


// Не робимо моноліти, коли все в одному файлі.
// Ми завжди юзаємо паттерн Рєекспорт. На бекенді це важливий паттерн. 
// У кожній папці робиться структура. І в кожній папці є index.js (навіть якщо у папці один файл)
// Папка controllers як приклад. У тебе буде багато контроллерів.
// В середині папка contacts,  а в ній вже функції
// Папка contacts/
//        - index.js
//        - addContact.js
//        - getAllContacts.js
//       і т.д


// В середині контролерів, кожна группа лежить у окремій папці
// controllers/
// contacts
// users
// auth
// posts
// index.js
//  і т.д